{
  "@context": {
    "ldp": "http://www.w3.org/ns/ldp#",
    "schema": "http://schema.org/",
    "fedora": "http://fedora.info/definitions/v4/repository#",
    "webac": "http://fedora.info/definitions/v4/webac#",
    "acl": "http://www.w3.org/ns/auth/acl#",
    "ucdlib": "http://digital.ucdavis.edu/schema#",
    "ebucore": "http://www.ebu.ch/metadata/ontologies/ebucore/ebucore#"
  },
  "@id": "",
  "@type": [
    "schema:Collection",
    "http://fedora.info/definitions/v4/repository#ArchivalGroup"
  ],
  "ucdlib:hasLabel": {
    "@id": "@base:/labels"
  },
  "schema:about": [
      {
        "@id": "http://id.worldcat.org/fast/931249"
      },
      {
        "@id": "http://id.worldcat.org/fast/931248"
      },
      {
        "@id": "http://id.worldcat.org/fast/1754974"
      }
    ],
  "schema:datePublished": {
    "@type": "http://www.w3.org/2001/XMLSchema#gYearMonthDay",
    "@value": "2025-11-10"
  },
  "schema:identifier": [
    "ark:/87293/d3f766g2w"
  ],
"schema:description": "Elaine Corn is a food editor, award-winning culinary journalist, and author of six cookbooks. Corn's journalism career started in Texas, where she received a Bachelor of Journalism from the University of Texas at Austin and worked as a copy editor and telegraph editor for the Dallas Morning News, and a copy editor and page one news editor at the Austin American-Statesman. While working at the Austin American-Statesman, Corn realized they were \"the last major newspaper in Texas to start a food section\", so she lobbied to start one, becoming the founding food editor in 1978.\n\nIn 1980, Corn left Texas and traveled through Europe and Israel, refining her culinary repertoire along the way. In 1981 she returned to the United States and took a job as the food editor at the Louisville Courier-Journal. In 1986 she was hired by the Sacramento Bee, where she spent the rest of her newspaper career. Under Corn's tenure, the Sacramento Bee won awards for Best Food Reporting and Best Food Section. She also met her husband, David SooHoo, a Cantonese chef, while working on a story. In 2005 Corn joined Capital Public Radio as a broadcast culinary reporter.\n\nCorn published her first cookbook, Gooey Desserts: The Joy of Decadence in 1993. Her second cookbook, Now You're Cooking: Everything a Beginner Needs to Know to Start Cooking Today was published in 1994 and won the Julia Child Cookbook Award and a James Beard Award in 1995. She went on to publish four more books over a ten-year period, with her last book published in 2002. In addition to writing cookbooks, Corn has been a contributor to publications including Cook's Illustrated, Food & Wine, Woman's Day, the Chicago Tribune, and the San Francisco Chronicle. She has also provided writing and recipes to other cookbooks such as Food Lover's Handbook to the Southwest and The Festive Table: Recipes and Stories for Creating Your Own Holiday Traditions.\n\nThe collection finding aid is available at the [Online Archive of California](https://oac.cdlib.org/findaid/ark:/13030/c8rv0wrk).",
  "schema:license": {
    "@id": "http://rightsstatements.org/vocab/InC-NC/1.0/"
  },
   "schema:image": {
    "@id": "@base:/elaine_corn.jpg"
  },
  "schema:name": "Elaine Corn CapRadio Segments",
  "schema:publisher": "UC Davis Library, Archives and Special Collections",
  "schema:sdDatePublished": {
    "@type": "http://www.w3.org/2001/XMLSchema#gYear",
    "@value": "2025"
  },
  "schema:sdLicense": {
    "@id": "http://rightsstatements.org/vocab/InC-NC/1.0/"
  },
  "schema:sdPublisher": "UC Davis Library, Archives and Special Collections"
}